// gen6-initial-instances.js
// ユーザーがGUIで編集する対象データ（instances）の初期シードデータ。
// 現段階ではIndexedDB未導入のため、このファイルの配列をそのままアプリのデータとして使用する。
// 将来的にIndexedDB化する際は、この配列を初回起動時の投入データ（シード）として利用する予定。

const INITIAL_INSTANCES = [
  {
    "id": "ウォッシュロトム1",
    "species": "ウォッシュロトム",
    "level": 50,
    "gender": "-",
    "raised": 0,
    "nature": "おくびょう",
    "ability": "ふゆう",
    "item": "オボンのみ",
    "ev": {
      "H": 252,
      "A": 0,
      "B": 4,
      "C": 52,
      "D": 4,
      "S": 196
    },
    "iv": {
      "H": 31,
      "A": 0,
      "B": 31,
      "C": 31,
      "D": 31,
      "S": 31
    },
    "moves": [
      "ハイドロポンプ",
      "10まんボルト",
      "よこどり",
      "まもる"
    ],
    "memo": "S:最速78族+1、準速91族+1",
    "tags": "補助,特殊"
  },
  {
    "id": "ギルガルド耐久振り",
    "species": "ギルガルド",
    "level": 50,
    "gender": "-",
    "raised": 1,
    "nature": "なまいき",
    "ability": "バトルスイッチ",
    "item": "たべのこし",
    "ev": {
      "H": 252,
      "A": 0,
      "B": 180,
      "C": 0,
      "D": 76,
      "S": 0
    },
    "iv": {
      "H": 31,
      "A": 0,
      "B": 31,
      "C": 31,
      "D": 31,
      "S": 0
    },
    "moves": [
      "シャドーボール",
      "どくどく",
      "ワイドガード",
      "キングシールド"
    ],
    "memo": "HB:特化珠キリキザンのはたきおとす6.3%の乱1(～102.9%)<br>HD:特化メガリザードンYの晴れWねっぷう耐え(～98.2%)<br>HD:特化珠ルンパッパの雨ねっとう確3(～49.7%)",
    "tags": "シールド,受け"
  },
  {
    "id": "ラティアスサンプル",
    "species": "ラティアス",
    "level": 50,
    "gender": "-",
    "raised": 0,
    "nature": "おくびょう",
    "ability": "ふゆう",
    "item": "オボンのみ",
    "ev": {
      "H": 252,
      "A": 0,
      "B": 0,
      "C": 4,
      "D": 0,
      "S": 252
    },
    "iv": {
      "H": 31,
      "A": 0,
      "B": 31,
      "C": 31,
      "D": 31,
      "S": 31
    },
    "moves": [
      "サイコキネシス",
      "リフレクター",
      "ひかりのかべ",
      "おいかぜ"
    ],
    "memo": "テスト",
    "tags": "補助,特殊"
  },
  {
    "id": "メガラティアスサンプル",
    "species": "ラティアス",
    "level": 50,
    "gender": "-",
    "raised": 0,
    "nature": "おくびょう",
    "ability": "ふゆう",
    "item": "メガストーン",
    "ev": {
      "H": 252,
      "A": 0,
      "B": 0,
      "C": 4,
      "D": 0,
      "S": 252
    },
    "iv": {
      "H": 31,
      "A": 0,
      "B": 31,
      "C": 31,
      "D": 31,
      "S": 31
    },
    "moves": [
      "サイコキネシス",
      "リフレクター",
      "ひかりのかべ",
      "おいかぜ"
    ],
    "memo": "テスト",
    "tags": "補助,特殊"
  },
  {
    "id": "メガリザードンY耐久振り",
    "species": "リザードン",
    "level": 50,
    "gender": "-",
    "raised": 0,
    "nature": "おくびょう",
    "ability": "もうか",
    "item": "メガストーンY",
    "ev": {
      "H": 172,
      "A": 0,
      "B": 196,
      "C": 0,
      "D": 0,
      "S": 140
    },
    "iv": {
      "H": 31,
      "A": 0,
      "B": 31,
      "C": 31,
      "D": 31,
      "S": 31
    },
    "moves": [
      "ねっぷう",
      "ソーラービーム",
      "オーバーヒート",
      "まもる"
    ],
    "memo": "テストY",
    "tags": "特殊,メガ"
  }
];
